# GetRebarContainerIterator Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarContainer..::..GetRebarContainerIterator Method
RebarContainer Class See Also
---
Returns a Rebar Container Iterator that iterates through the Rebar Container Items.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public RebarContainerIterator GetRebarContainerIterator()
```

Visual Basic
---
```text
Public Function GetRebarContainerIterator As RebarContainerIterator
```

Visual C++
---
```text
public:
RebarContainerIterator^ GetRebarContainerIterator()
```

# ### Return Value
A Rebar Container Iterator object that can be used to iterate through Rebar Container Items in the collection.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace